app/controllers/api/shows_controller.rb

    def index
        @shows = Show.all
---
SELECT  "shows".* FROM "shows" ORDER BY "shows"."id" ASC LIMIT $1  [["LIMIT", 1]]