app/models/user.rb

    def reset_session_token!
        self.update!(session_token: self.class.generate_session_token)
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "dica7ynSoEtAPCaMdoxHxA"], ["updated_at", "2020-04-07 19:21:37.258900"], ["id", 1]]